<img src="https://pandas.pydata.org/static/img/pandas.svg" width="250">

## <center> Advanced Pandas

## Intro to Dataframes

In [34]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
# Defining a regular Python dictionary

scores = {"name" : ['Ray', 'Japhy', 'Zosa'],
          "city" : ['San Francisco', 'San Francisco', 'Denver'],
          "score" : [75, 92, 94]
          }

In [3]:
scores

{'name': ['Ray', 'Japhy', 'Zosa'],
 'city': ['San Francisco', 'San Francisco', 'Denver'],
 'score': [75, 92, 94]}

In [4]:
# Converting the dictionary to a Pandas Dataframe

df = pd.DataFrame(scores)

In [5]:
df

    name           city  score
0    Ray  San Francisco     75
1  Japhy  San Francisco     92
2   Zosa         Denver     94

Notice that indices were created when the dictionary was converted to a Pandas Dataframe.

**Pandas DataFrame** is a **two-dimensional labeled data structure** in Python's Pandas library. It is a table-like data structure where each column can have a different data type (such as numerical, categorical, or date/time) and each row is labeled with an *index*.

DataFrames can be thought of as a **spreadsheet** or **SQL table**, with rows and columns of data, but with the added functionality of powerful data manipulation and analysis tools. They can be created from a variety of data sources, including CSV files, SQL databases, and Python dictionaries.

Some of the key features of Pandas DataFrames include **indexing and selection**, **filtering**, **aggregation and grouping**, **merging and joining**, and **handling missing data**. They are commonly used for data exploration, cleaning, transformation, and analysis in data science and machine learning applications.

In [6]:
# Checking individual columns. "df.score" could also be used and produce the same result

df['score']

0    75
1    92
2    94
Name: score, dtype: int64

In [7]:
# Creating a new column by combining values from an existing in a different column

df['name_city'] = df['name'] + df['city']
df['name_city']

0      RaySan Francisco
1    JaphySan Francisco
2            ZosaDenver
Name: name_city, dtype: object

In [8]:
# Filtering through the dataframe by selecting only rows with score greater than 90

df[df['score']>90]

    name           city  score           name_city
1  Japhy  San Francisco     92  JaphySan Francisco
2   Zosa         Denver     94          ZosaDenver

## Top Pandas Functions

### Eploring your Data

In [9]:
# Importing CSV as Pandas DataFrame

df_iris = pd.read_csv('datasets/iris.csv')

In [10]:
#Checking the first 3 rows through .head function. Returns 5 rows when not defined

df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [11]:
# Checking the dimensions of data

df_iris.shape

(150, 5)

In [12]:
# Checking the bottom rows

df_iris.tail(3)

     sepal_length  sepal_width  petal_length  petal_width    species
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [13]:
# Checking the datatypes assigned by Pandas to each of the columns

df_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

### Subsetting your data with loc and iloc functions

In [14]:
df_iris.loc[3:5]

   sepal_length  sepal_width  petal_length  petal_width species
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

In [15]:
df_iris.loc[3,'sepal_length']

4.6

In [16]:
#Locating data

df_iris.iloc[3,0]

4.6

In [17]:
#Exporting data as csv

df_iris.to_csv('iris-output.csv', index=False)

### Options

In [20]:
df_emissions = pd.DataFrame({"country":['China','United States','India'],
          "year":['2018','2018','2018'],
          "co2_emissions":[10060000000.0,5410000000.0,2650000000.0]})

The pandas.set_option() function can be used to set various options in pandas, including options related to the display of rows and columns in DataFrames.

The max_rows and max_columns options can be useful when working with large DataFrames, as they allow you to control the number of rows and columns that are displayed when you print or view a DataFrame.

By default, pandas will display only a small number of rows and columns when you print a DataFrame. If you have a large DataFrame with many rows and/or columns, you may want to increase the number of rows and columns that are displayed so that you can see more of the data at once.

It's important to note that displaying very large DataFrames can be slow and may consume a lot of memory, so it's generally best to use these options with care and only when you really need to view all the data.

In [27]:
# Limits display of max rows to 2 columns

pd.options.display.max_rows = 2
df_emissions

   country  year  co2_emissions
0    China  2018   1.006000e+10
..     ...   ...            ...
2    India  2018   2.650000e+09

[3 rows x 3 columns]

In [28]:
# Limits display of max columns to 2 columns

pd.options.display.max_columns = 2
df_emissions

   country  ... co2_emissions
0    China  ...  1.006000e+10
..     ...  ...           ...
2    India  ...  2.650000e+09

[3 rows x 3 columns]

In [29]:
# Modifying float format options

pd.options.display.float_format = '{:,.2f}'.format
df_emissions

   country  ...     co2_emissions
0    China  ... 10,060,000,000.00
..     ...  ...               ...
2    India  ...  2,650,000,000.00

[3 rows x 3 columns]

In [35]:
# Removing the options and going back to default

pd.reset_option('all')

## Advanced Calculations

In [36]:
df_planets = pd.read_csv('datasets/planets.csv')
df_planets.head(3)

            method  number  orbital_period  mass  distance  year
0  Radial Velocity       1         269.300  7.10     77.40  2006
1  Radial Velocity       1         874.774  2.21     56.95  2008
2  Radial Velocity       1         763.000  2.60     19.84  2011

In [37]:
# Using the mean function - it'll only return values for float and integer type data

df_planets.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [41]:
[df_planets.loc[0,'number'], df_planets.loc[0,'mass']]

[1, 7.1]

In [42]:
1/7.1

0.14084507042253522

In [38]:
# Dividing an integer column by a float. Column number and mass, row 0

df_planets['number'][0]/df_planets['mass'][0]

0.14084507042253522

In [39]:
# Convert an integer type column to a float. 

df_planets['number'][0].astype(float)

1.0

In [43]:
# Converting year column 0 to a string

df_planets['year'][0].astype(str)

'2006'

In [44]:
# Converting the year column to a datetime (YYYY-MM-DD)

df_planets['year_dt'] = pd.to_datetime(df_planets['year'], format='%Y')
df_planets['year_dt']

0      2006-01-01
1      2008-01-01
2      2011-01-01
3      2007-01-01
4      2009-01-01
          ...
1030   2006-01-01
1031   2007-01-01
1032   2007-01-01
1033   2008-01-01
1034   2008-01-01
Name: year_dt, Length: 1035, dtype: datetime64[ns]

##